app/controllers/drinks_controller.rb

  def create
    @drink = Drink.new(drink_params)
    if @drink.save
---
INSERT INTO "drinks" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def index
    @drinks = Drink.page(params[:page])
---
SELECT  "drinks".* FROM "drinks" LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "drinks" LIMIT 25 OFFSET 0) subquery_for_count

  def destroy
    Drink.destroy(params[:id])
---
DELETE FROM "drinks" WHERE "drinks"."id" = $1  [["id", 43]]